//解构赋值是对赋值运算符的扩展。
// 他是一种针对数组或者对象进行模式匹配，然后对其中的变量进行赋值。
// 在代码书写上简洁且易读，语义更加清晰明了；也方便了复杂对象中数据字段获取。

// 数组模型的解构
//基本
//let [a,b,c] = [1,2,3]
// a = 1
// b = 2
// c = 3
//可嵌套
//let [a, [[b], c]] = [1, [[2], 3]];
// a = 1
// b = 2
// c = 3
//可忽略
//let [a, , b] = [1, 2, 3];
// a = 1
// b = 3
//剩余运算符
//let [a,...b] = [1,2,3,]
//a = 1
//b = [2, 3]
//字符串
//let [a, b, c, d, e] = 'hello';
// a = 'h'
// b = 'e'
// c = 'l'
// d = 'l'
// e = 'o'

//对象模型的解构
// 基本
// let { foo, bar } = { foo: 'aaa', bar: 'bbb' };
// foo = 'aaa'
// bar = 'bbb'

//let { baz: foo } = { baz: 'ddd' };
// foo = 'ddd'
//剩余运算符
//let { a, b, ...rest } = { a: 10, b: 20, c: 30, d: 40 };
// a = 10
// b = 20
// rest = {c: 30, d: 40}